spec/vcr/fix_missing_subscriptions/nonbraintree_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://DFLe4nAkwg13WPSwqmWP:X@lootcratetest.chargify.com/subscriptions/6567534.xml
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/xml; charset=utf-8
      Date:
      - Sat, 17 Jan 2015 22:19:20 GMT
      Etag:
      - '"d6a0a2de182d3fb35bc351028e865c9f"'
      P3p:
      - CP="NOI ADM DEV PSAi COM NAV OUR OTRo STP IND DEM"
      Server:
      - nginx + Phusion Passenger
      Set-Cookie:
      - _chargify_session=BAh7CEkiD3Nlc3Npb25faWQGOgZFVEkiJWFkNDM3YmIxN2YxNzRlMjg1NjRmZmM4NjAzZWI1NDVlBjsAVEkiF3NlbGxlcl9jcmVkZW50aWFscwY7AEZJIgGANzNkYTU3ZmQyYzhjMThmYzhjZDRiYjAyMzJiNGM4NWM1MzNiMWE5NGNhNGE0NGQyMjQ2MTcxOThlMGVlYzA3ZjFjYmRlOWU0ZTAxMjBlYzY0ZjFiMDM1Mzg5ODdjOGYzYzA1NzlhYjUxNzE2OWMyZjlhYjQ4NGE2ZjQyMzU1YzMGOwBGSSIac2VsbGVyX2NyZWRlbnRpYWxzX2lkBjsARmkCADI%3D--3a7603a038874e2d8140fe0e038f355f9d97c352;
        domain=.chargify.com; path=/; secure; HttpOnly
      Status:
      - 200 OK
      Strict-Transport-Security:
      - max-age=31536000
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger
      X-Rack-Cache:
      - miss
      X-Ratelimit-Limit:
      - '1000000'
      X-Ratelimit-Remaining:
      - '999999'
      X-Ratelimit-Reset:
      - '1421539200'
      X-Request-Id:
      - 2eb3510d-4f7c-4c8b-a714-024410f074fa
      X-Runtime:
      - '0.307919'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '5139'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <subscription>
          <activated_at type="datetime">2014-09-26T00:14:54-04:00</activated_at>
          <balance_in_cents type="integer">0</balance_in_cents>
          <cancel_at_end_of_period type="boolean" nil="true"/>
          <canceled_at type="datetime" nil="true"/>
          <cancellation_message nil="true"/>
          <created_at type="datetime">2014-09-26T00:14:53-04:00</created_at>
          <current_period_ends_at type="datetime">2015-01-25T23:14:53-05:00</current_period_ends_at>
          <expires_at type="datetime" nil="true"/>
          <id type="integer">6567534</id>
          <next_assessment_at type="datetime">2015-01-25T23:14:53-05:00</next_assessment_at>
          <payment_collection_method>automatic</payment_collection_method>
          <snap_day nil="true"/>
          <state>active</state>
          <trial_ended_at type="datetime" nil="true"/>
          <trial_started_at type="datetime" nil="true"/>
          <updated_at type="datetime">2014-12-25T23:25:02-05:00</updated_at>
          <current_period_started_at type="datetime">2014-12-25T23:14:53-05:00</current_period_started_at>
          <previous_state>active</previous_state>
          <signup_payment_id type="integer">69518672</signup_payment_id>
          <signup_revenue>21.11</signup_revenue>
          <delayed_cancel_at nil="true"/>
          <coupon_code nil="true"/>
          <total_revenue_in_cents type="integer">8444</total_revenue_in_cents>
          <product_price_in_cents type="integer">1937</product_price_in_cents>
          <product_version_number type="integer">2</product_version_number>
          <payment_type>credit_card</payment_type>
          <current_billing_amount_in_cents type="integer">2111</current_billing_amount_in_cents>
          <customer>
            <address>666 Stix Rvr</address>
            <address_2 nil="true"/>
            <city>Hell</city>
            <country>US</country>
            <created_at type="datetime">2014-09-26T00:14:53-04:00</created_at>
            <email>email58@purp.com</email>
            <first_name>El</first_name>
            <id type="integer">6430281</id>
            <last_name>Diablo</last_name>
            <organization nil="true"/>
            <phone nil="true"/>
            <portal_customer_created_at type="datetime" nil="true"/>
            <portal_invite_last_accepted_at type="datetime" nil="true"/>
            <portal_invite_last_sent_at type="datetime" nil="true"/>
            <reference nil="true"/>
            <state>CA</state>
            <updated_at type="datetime">2014-09-26T00:14:53-04:00</updated_at>
            <verified type="boolean">false</verified>
            <zip>90025</zip>
          </customer>
          <product>
            <accounting_code>1month</accounting_code>
            <archived_at type="datetime" nil="true"/>
            <created_at type="datetime">2012-08-26T22:59:11-04:00</created_at>
            <description>One Month Recurring Subscription to Loot Crate! (US Only)</description>
            <expiration_interval type="integer" nil="true"/>
            <expiration_interval_unit>never</expiration_interval_unit>
            <handle>1-month-subscription</handle>
            <id type="integer">2828189</id>
            <initial_charge_in_cents type="integer" nil="true"/>
            <interval type="integer">1</interval>
            <interval_unit>month</interval_unit>
            <name>One Month Subscription</name>
            <price_in_cents type="integer">1937</price_in_cents>
            <request_credit_card type="boolean">true</request_credit_card>
            <require_credit_card type="boolean">true</require_credit_card>
            <return_params>id={customer_id}&amp;ref={customer_reference}&amp;sid={subscription_id}&amp;attributes={customer_attributes}</return_params>
            <return_url>http://polar-waters-8702.herokuapp.com/payment_completed/index?pid=1</return_url>
            <taxable type="boolean">true</taxable>
            <trial_interval type="integer" nil="true"/>
            <trial_interval_unit>month</trial_interval_unit>
            <trial_price_in_cents type="integer" nil="true"/>
            <update_return_url>http://polar-waters-8702.herokuapp.com/payment_completed/index?</update_return_url>
            <updated_at type="datetime">2013-02-26T16:16:15-05:00</updated_at>
            <product_family>
              <accounting_code nil="true"/>
              <description>Monthly Subscription Design</description>
              <handle>1993521</handle>
              <id type="integer">284858</id>
              <name>Loot Crate's Monthly Box</name>
            </product_family>
            <public_signup_pages type="array">
              <public_signup_page>
                <id type="integer">28406</id>
                <url>http://lootcratetest.chargify.com/subscribe/673a38133523/1-month-subscription</url>
              </public_signup_page>
            </public_signup_pages>
          </product>
          <credit_card>
            <billing_address>666 Stix Rvr</billing_address>
            <billing_address_2 nil="true"/>
            <billing_city>Hell</billing_city>
            <billing_country>US</billing_country>
            <billing_state>CA</billing_state>
            <billing_zip>90025</billing_zip>
            <card_type>bogus</card_type>
            <current_vault>bogus</current_vault>
            <customer_id type="integer">6430281</customer_id>
            <customer_vault_token nil="true"/>
            <expiration_month type="integer">6</expiration_month>
            <expiration_year type="integer">2023</expiration_year>
            <first_name>El</first_name>
            <id type="integer">4181354</id>
            <last_name>Diablo</last_name>
            <masked_card_number>XXXX-XXXX-XXXX-1</masked_card_number>
            <vault_token>1</vault_token>
            <payment_type>credit_card</payment_type>
          </credit_card>
        </subscription>
    http_version: 
  recorded_at: Sat, 17 Jan 2015 22:19:20 GMT
recorded_with: VCR 2.9.3
